# 参考: https://qiita.com/vochicong/items/f20afc89a6847cd58f0f

cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
brew "mas"

# Basic commands
brew "docker"
brew "git"
brew "gh"
brew "pre-commit"
brew "vim"
brew "zsh"
brew "zplug"
brew "gawk"
brew "gnu-sed"
brew "tree"
brew "wget"
brew "xz"
brew "peco"
brew "openssh"
brew "starship"

# Substitution of basic commands
# https://zenn.dev/the_exile/articles/5176b7a5c29bce
brew "dust"
brew "bat"
brew "exa"
brew "fd"
brew "duf"
brew "procs"
brew "bottom"
brew "zoxide"
brew "ripgrep"
brew "httpie"

# Programming environment
# https://zenn.dev/ryuu/articles/use-anyversions
brew "anyenv"

# Python
brew "poetry"
brew "venv"
# brew "pipx"
# brew "pyenv"

# Public cloud CLI commands
## GCP
## https://zenn.dev/phi/articles/gcloud-setup-with-homebrew-on-mac
cask "google-cloud-sdk"

## AWS
## https://zenn.dev/akakuro/articles/30f570b8863bef
brew "awscli"

## Azure
## https://learn.microsoft.com/ja-jp/cli/azure/install-azure-cli-macos
brew "azure-cli"

# Basic apps
## Browser
# cask "brave-browser"

## Editor
cask "visual-studio-code"

## Business
# cask "google-drive"
# cask "zoom"

## Usefuls
cask "alfred"
cask "authy"
cask "google-japanese-ime"
# cask "karabiner-elements"
cask "cold-turkey-blocker"
cask "hyperswitch"
cask "copyclip"
cask "funter"
cask "keyboardcleantool"
cask "obsidian"
mas "LINE", id: 539883307

## Hobbies
cask "spotify"
cask "mp3gain-express"
cask "android-file-transfer"

## Programming
cask "iterm2"
cask "docker"
# cask "arctype"
