# 参考: https://qiita.com/vochicong/items/f20afc89a6847cd58f0f

cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/core"
brew "mas"

# CLI commands
# ==================================================================
# Basic commands
brew "git"
brew "gh"
brew "pre-commit"
brew "vim"
brew "zsh"
brew "zplug"
brew "gawk"
brew "gnu-sed"
brew "tree"
brew "wget"
brew "openssh"
brew "gitmoji" # git commitするときの絵文字一覧
brew "git-secrets" # credentialファイルをgit commitしないようにする
brew "peco" # 高度な検索
brew "xz" # ファイル圧縮
brew "glow" # ターミナルでMarkdownをプレビュー
brew "tig" # Gitリポジトリの履歴確認
brew "shellcheck" # Shell Scirptの静的解析
brew "starship" # zshのプロンプトのカスタマイズ

# Substitution of basic commands
# https://zenn.dev/the_exile/articles/5176b7a5c29bce
brew "zoxide" # `cd`
brew "exa" # `ls`
brew "fd" # `find`
brew "bat" # `cat`
brew "ripgrep" # `grep`
brew "httpie" # `curl``
brew "procs" # `ps`
brew "bottom" # `top`
brew "duf" # `df`
brew "dust" # `du`

# Programming environment
# https://zenn.dev/ryuu/articles/use-anyversions
brew "anyenv"

# Python
brew "pipx"

# Public clouds' CLI command
## GCP
## https://zenn.dev/phi/articles/gcloud-setup-with-homebrew-on-mac
cask "google-cloud-sdk"

## AWS
## https://zenn.dev/akakuro/articles/30f570b8863bef
brew "awscli"

## Azure
## https://learn.microsoft.com/ja-jp/cli/azure/install-azure-cli-macos
brew "azure-cli"
# ==================================================================

# Basic apps
# ==================================================================
## Browser
cask "brave-browser"
cask "microsoft-edge"

## Editor
cask "visual-studio-code"

## Business
cask "google-drive"
cask "zoom"
cask "microsoft-remote-desktop"

## Usefuls
cask "karabiner-elements"
cask "alfred"
cask "authy"
cask "google-japanese-ime"
cask "cold-turkey-blocker"
# cask "hyperswitch" 2023-04-15時点で消滅している？
cask "alt-tab"
cask "funter"
cask "keyboardcleantool"
cask "obsidian"
mas "CopyClip - Clipboard History", id: 595191960
mas "LINE", id: 539883307

## Hobbies
cask "spotify"
cask "mp3gain-express"
cask "android-file-transfer"

## Programming
cask "warp"
# cask "iterm2"
cask "docker"
# cask "tableplus"
# ==================================================================
