# 参考: https://qiita.com/vochicong/items/f20afc89a6847cd58f0f

cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/core"
brew "mas"

# CLI commands
# ==================================================================
# Basic commands
brew "git"
brew "gh"
brew "pre-commit"
brew "vim"
brew "zsh"
brew "gawk"
brew "gnu-sed"
brew "tree"
brew "wget"
brew "openssh"
brew "gitmoji"     # git commitするときの絵文字一覧
brew "git-secrets" # credentialファイルをgit commitしないようにする
brew "peco"        # 高度な検索
brew "xz"          # ファイル圧縮
brew "glow"        # ターミナルでMarkdownをプレビュー
brew "tig"         # Gitリポジトリの履歴確認
brew "shellcheck"  # Shell Scirptの静的解析
brew "starship"    # zshのプロンプトのカスタマイズ

# Substitution of basic commands
# https://zenn.dev/the_exile/articles/5176b7a5c29bce
brew "zoxide"    # `cd`
brew "exa"       # `ls`
brew "fd"        # `find`
brew "bat"       # `cat`
brew "ripgrep"   # `grep`
brew "httpie"    # `curl``
brew "procs"     # `ps`
brew "bottom"    # `top`
brew "duf"       # `df`
brew "dust"      # `du`
brew "trash-cli" # `rm`

# Virtual environment
brew "asdf"
brew "anyenv"

# Python
brew "pipx"
# brew "rye" # 公式ページ<https://rye-up.com/guide/installation/>にHomebrewのインストールオプションがないのでやめておく

# Public clouds' CLI command
## GCP
## https://zenn.dev/phi/articles/gcloud-setup-with-homebrew-on-mac
cask "google-cloud-sdk"

## AWS
## https://zenn.dev/akakuro/articles/30f570b8863bef
brew "awscli"

## Azure
## https://learn.microsoft.com/ja-jp/cli/azure/install-azure-cli-macos
brew "azure-cli"
# ==================================================================

# Desktop applications
# ==================================================================
## Browser
cask "brave-browser"
cask "arc"

## Text editor
cask "visual-studio-code"

## Infrastructure
# cask "docker"
cask "rancher"
cask "google-drive"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "raycast"
cask "warp"
cask "zoom"

## Usefulls
cask "android-file-transfer"
cask "alt-tab"
cask "cold-turkey-blocker"
cask "funter"
cask "keyboardcleantool"
cask "mp3gain-express"
cask "obsidian"
cask "spotify"
# cask "hyperswitch" # 2023-04-15時点で消滅している？
# cask "lm-studio"
# cask "microsoft-remote-desktop"
# cask "tableplus"
# cask "microsoft-azure-storage-explorer"

mas "CopyClip - Clipboard History", id: 595191960
mas "Focus To-Do", id: 1258530160
mas "LINE", id: 539883307
# ==================================================================
