cask_args appdir: "/Applications"

# ==================================================================
# CLI commands
# ==================================================================
# Basic commands
brew "git"
brew "gh"
brew "pre-commit"
brew "vim"
brew "neovim"
brew "zsh"
brew "gawk"
brew "gnu-sed"
brew "tree"
brew "wget"
brew "openssh"
brew "go-task"
brew "git-secrets" # credentialファイルをgit commitしないようにする
brew "peco"        # 高度な検索
brew "xz"          # ファイル圧縮
brew "glow"        # ターミナルでMarkdownをプレビュー
brew "tig"         # Gitリポジトリの履歴確認
brew "pinact"      # GitHub Action のタグをコミットSHAに
brew "direnv"      # gcloud のADC認証設定をディレクトリ単位で .envrc で切り替える

# Substitution of basic commands
# https://zenn.dev/the_exile/articles/5176b7a5c29bce
brew "zoxide"    # `cd`
brew "lsd"       # `ls`
brew "fd"        # `find`
brew "bat"       # `cat`
brew "ripgrep"   # `grep`
brew "httpie"    # `curl``
brew "procs"     # `ps`
brew "bottom"    # `top`
brew "duf"       # `df`
brew "dust"      # `du`
brew "trash-cli" # `rm`

# Zsh plugin manager
brew "sheldon"

# Virtual environment / Version manager
brew "mise"

# Python
brew "uv"
# brew "pipx"

# Agent skills
# https://github.com/microsoft/apm
tap "microsoft/apm"
brew "apm" # 外部エージェントスキルを apm/apm.yml で宣言的に管理

# Public clouds' CLI command
## Google Cloud
## https://zenn.dev/phi/articles/gcloud-setup-with-homebrew-on-mac
cask "google-cloud-sdk"

## AWS
## https://zenn.dev/akakuro/articles/30f570b8863bef
brew "awscli"

## Azure
## https://learn.microsoft.com/ja-jp/cli/azure/install-azure-cli-macos
# brew "azure-cli"

# Data Warehouse/Lakehouse
## Snowflake
## https://docs.snowflake.com/en/developer-guide/snowflake-cli/installation/installation
tap "snowflakedb/snowflake-cli"
brew "snowflake-cli"

## Databricks
## https://docs.databricks.com/aws/en/dev-tools/cli/install
tap "databricks/tap"
brew "databricks/tap/databricks"

# Secret Management
# https://infisical.com/docs/cli/overview
brew "infisical/get-cli/infisical"

# たわらさんのフォントシリーズ
# https://github.com/yuru7/HackGen
cask "font-hack-nerd-font"
cask "font-plemol-jp"

# ==================================================================
# Desktop applications
# ==================================================================
# Browser
cask "brave-browser"
cask "google-chrome"

# Text editor
cask "visual-studio-code"
# cask "cursor"

# AI
cask "claude"
cask "chatgpt"
cask "claude-code"
cask "codex"
cask "codex-app"

# Infrastructure
cask "google-drive"
cask "azooKey" # 公式のGitHubのREADMEだと brew で入れるようになっているが、正しくは cask で入れる
cask "karabiner-elements"
cask "raycast"
cask "zoom"
cask "android-platform-tools"

# Programming
# cask "docker"
cask "rancher"  # Docker Desktop とコンフリクトするのでどっちかにする
cask "ghostty"
cask "windows-app" # 旧 microsoft-remote-desktop
# cask "lm-studio"
# cask "tableplus"

# Sound
cask "mp3gain-express"
cask "blackhole-2ch"

# Usefulls
cask "alt-tab"
cask "funter"
cask "keyboardcleantool"
cask "obsidian"
cask "spotify"
# cask "cold-turkey-blocker"
# cask "tunnelblick"
# cask "aqua-voice"

# DroidDock
tap "rajivm1991/droiddock"
cask "rajivm1991/droiddock/droiddock"
