cask_args appdir: "/Applications"

# ==================================================================
# CLI commands
# ==================================================================
# Basic commands
brew "git"
brew "gh"
brew "pre-commit"
brew "vim"
brew "zsh"
brew "gawk"
brew "gnu-sed"
brew "tree"
brew "wget"
brew "openssh"
brew "go-task"
brew "gitmoji"     # git commitするときの絵文字一覧
brew "git-secrets" # credentialファイルをgit commitしないようにする
brew "peco"        # 高度な検索
brew "xz"          # ファイル圧縮
brew "glow"        # ターミナルでMarkdownをプレビュー
brew "tig"         # Gitリポジトリの履歴確認
brew "shellcheck"  # Shell Scirptの静的解析
# brew "starship"    # zshのプロンプトのカスタマイズ

# Substitution of basic commands
# https://zenn.dev/the_exile/articles/5176b7a5c29bce
brew "zoxide"    # `cd`
brew "lsd"       # `ls`
brew "fd"        # `find`
brew "bat"       # `cat`
brew "ripgrep"   # `grep`
brew "httpie"    # `curl``
brew "procs"     # `ps`
brew "bottom"    # `top`
brew "duf"       # `df`
brew "dust"      # `du`
brew "trash-cli" # `rm`

# Virtual environment
brew "asdf"

# Python
brew "uv"
# brew "pipx"

# Public clouds' CLI command
## Google Cloud
## https://zenn.dev/phi/articles/gcloud-setup-with-homebrew-on-mac
cask "google-cloud-sdk"

## AWS
## https://zenn.dev/akakuro/articles/30f570b8863bef
brew "awscli"

## Azure
## https://learn.microsoft.com/ja-jp/cli/azure/install-azure-cli-macos
brew "azure-cli"

# たわらさんのフォントシリーズ
# https://github.com/yuru7/HackGen
cask "font-hack-nerd-font"
cask "font-plemol-jp"

#==================================================================
# Desktop applications
# ==================================================================
# Browser
cask "brave-browser"
# cask "arc"

# Text editor
cask "visual-studio-code"
cask "cursor"

# Infrastructure
cask "google-drive"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "raycast"
cask "zoom"

# Programming
# cask "docker"
cask "rancher"  # Docker Desktop とコンフリクトするのでどっちかにする
cask "warp"
# cask "lm-studio"
# cask "tableplus"
# cask "microsoft-azure-storage-explorer"

# Usefulls
cask "android-file-transfer"
cask "alt-tab"
# cask "cold-turkey-blocker"  # 最近はあまり使ってないのでコメントアウト
cask "funter"
cask "keyboardcleantool"
cask "mp3gain-express"
cask "obsidian"
cask "spotify"
cask "tunnelblick"
# cask "hyperswitch" # 2023-04-15時点で消滅している？
# cask "microsoft-remote-desktop"
